# read data with pandas

In [1]:
import pandas as pd

In [19]:
df = pd.read_csv('data/MonthlySales.csv')

In [21]:
df.head()

        month     sales
0  2013-01-01  14236.90
1  2013-02-01   4519.89
2  2013-03-01  55691.01
3  2013-04-01  28295.35
4  2013-05-01  23648.29

In [22]:
import json
from pandas.io.json import json_normalize

with open('data/monthlySalesbyCategoryMultiple.json') as json_data:
    data = json.load(json_data)

In [25]:
df = pd.json_normalize(data['contents'], 'monthlySales', ['category', 'region'])

In [26]:
df.head()

      month  sales   category region
0  20130101     38  Furniture   West
1  20130201     35  Furniture   West
2  20130301     41  Furniture   West
3  20130401     55  Furniture   West
4  20130501     58  Furniture   West

In [27]:
# reading parquet files
import pyarrow.parquet as pq

In [29]:
table = pq.read_table('data/monthlyProductSales.parquet')

In [30]:
table.to_pandas()

,Month of Order Date,Product Name,Sales
0,b'2017-01-13',b'Xerox 1972',11
1,b'2017-01-13',b'Xerox 1923',37
2,b'2017-01-13',b'Xerox 225',19
3,b'2017-01-13',b'Xerox 195',40
4,b'2017-01-13',b'Wireless Extenders zBoost YX545 SOHO Signal ...,756
...,...,...,...
9247,b'2017-12-16',b'14-7/8 x 11 Blue Bar Computer Printout Paper',96
9248,b'2017-12-16',"b'6"" Cubicle Wall Clock, Black'",10
9249,b'2017-12-16',b'3M Hangers With Command Adhesive',10
9250,b'2017-12-16',b'3.6 Cubic Foot Counter Height Office Refrige...,295
9251,b'2017-12-16',b'3-ring staple pack',9

In [31]:
%pip install html5lib

Requirement already satisfied: html5lib in /Users/robsontrajano/opt/anaconda3/lib/python3.8/site-packages (1.1)
Requirement already satisfied: webencodings in /Users/robsontrajano/opt/anaconda3/lib/python3.8/site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in /Users/robsontrajano/opt/anaconda3/lib/python3.8/site-packages (from html5lib) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [43]:
# reading data from an html site
df = pd.read_html('https://en.wikipedia.org/wiki/List_of_U.S._state_abbreviations')

In [68]:
df_usa = df[2]

In [69]:
df_usa.head()

,Unnamed: 0,California,Colorado,Delaware,Hawaii,Kansas,Michigan,Mississippi,Massachusetts,Nebraska,Washington,Wisconsin,Mariana Islands
0,USPS,CA,CO,DE,HI,KS,MI,MS,MA,NE,WA,WI,MP
1,USCG,CF,CL,DL,HA,KA,MC,MI,MS,NB,WN,WS,CM

In [72]:
df_usa['California']

0    CA
1    CF
Name: California, dtype: object

In [73]:
df_usa.describe()

,Unnamed: 0,California,Colorado,Delaware,Hawaii,Kansas,Michigan,Mississippi,Massachusetts,Nebraska,Washington,Wisconsin,Mariana Islands
count,2,2,2,2,2,2,2,2,2,2,2,2,2
unique,2,2,2,2,2,2,2,2,2,2,2,2,2
top,USCG,CA,CO,DE,HA,KS,MC,MI,MA,NE,WN,WS,CM
freq,1,1,1,1,1,1,1,1,1,1,1,1,1

In [74]:
df_usa.columns

Index(['Unnamed: 0', 'California', 'Colorado', 'Delaware', 'Hawaii', 'Kansas',
       'Michigan', 'Mississippi', 'Massachusetts', 'Nebraska', 'Washington',
       'Wisconsin', 'Mariana Islands'],
      dtype='object')

In [75]:
df_usa.index

RangeIndex(start=0, stop=2, step=1)

In [76]:
# remove unnecessary rows and columns
final_df = df_usa.drop(df_usa.index[0]).drop(df_usa.columns[0], axis=1)

In [77]:
# rename columns
final_df.rename(columns={0: 'Region Name', 1: 'Region Status', 2: 'ISO', 3: 'ANSI_Letter', 4: 'ANSI_Code'
                         , 5: 'USPS', 6: 'USCG', 7: 'GPO', 8: 'AP', 9: 'Other Abbreviations'}, inplace=True)

In [78]:
final_df.columns

Index(['California', 'Colorado', 'Delaware', 'Hawaii', 'Kansas', 'Michigan',
       'Mississippi', 'Massachusetts', 'Nebraska', 'Washington', 'Wisconsin',
       'Mariana Islands'],
      dtype='object')

In [79]:
final_df.reset_index(drop=True)

,California,Colorado,Delaware,Hawaii,Kansas,Michigan,Mississippi,Massachusetts,Nebraska,Washington,Wisconsin,Mariana Islands
0,CF,CL,DL,HA,KA,MC,MI,MS,NB,WN,WS,CM

In [80]:
final_df.head()

,California,Colorado,Delaware,Hawaii,Kansas,Michigan,Mississippi,Massachusetts,Nebraska,Washington,Wisconsin,Mariana Islands
1,CF,CL,DL,HA,KA,MC,MI,MS,NB,WN,WS,CM

# inspect dataframes with pandas

In [81]:
import pandas as pd

In [83]:
df = pd.read_csv('data/MonthlyProductSales.csv', encoding='cp1252')
df.head(10)

,Month of Order Date,Product Name,Sales
0,2013-05-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",208.0
1,2015-06-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",208.0
2,2013-11-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",333.0
3,2016-07-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",416.0
4,2016-11-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",500.0
5,2015-08-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",1041.0
6,2013-11-01,1/4 Fold Party Design Invitations & White Enve...,6.0
7,2014-11-01,1/4 Fold Party Design Invitations & White Enve...,44.0
8,2014-12-01,3-ring staple pack,4.0
9,2013-01-01,3-ring staple pack,6.0

In [84]:
df.tail(10)

     Month of Order Date                Product Name  Sales
9242          2015-07-01  Zipper Ring Binder Pockets    2.0
9243          2015-12-01  Zipper Ring Binder Pockets    3.0
9244          2016-01-01  Zipper Ring Binder Pockets    3.0
9245          2015-11-01  Zipper Ring Binder Pockets    4.0
9246          2014-11-01  Zipper Ring Binder Pockets    6.0
9247          2016-06-01  Zipper Ring Binder Pockets    6.0
9248          2016-07-01  Zipper Ring Binder Pockets   10.0
9249          2013-04-01  Zipper Ring Binder Pockets   14.0
9250          2016-12-01  Zipper Ring Binder Pockets   15.0
9251          2013-07-01  Zipper Ring Binder Pockets   16.0

In [85]:
df.describe()

              Sales
count   9252.000000
mean     248.308798
std      669.441779
min        0.000000
25%       18.000000
50%       60.000000
75%      222.000000
max    22638.000000

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9252 entries, 0 to 9251
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Month of Order Date  9252 non-null   object
 1   Product Name         9252 non-null   object
 2   Sales                9252 non-null   float64
dtypes: float64(1), object(2)
memory usage: 217.0+ KB

In [87]:
df.columns

Index(['Month of Order Date', 'Product Name', 'Sales'], dtype='object')

In [89]:
series = df['Product Name']

series.value_counts(dropna=False)

Easy-staple paper                                                          32
Staple envelope                                                            30
Staples                                                                    30
Staples in misc. colors                                                    18
KI Adjustable-Height Table                                                 14
                                                                           ..
Vtech AT&T CL2940 Corded Speakerphone, Black                                1
Cisco 8961 IP Phone Charcoal                                                1
Sanitaire Vibra Groomer IR Commercial Upright Vacuum, Replacement Belts     1
Newell 342                                                                  1
Park Ridge Embossed Executive Business Envelopes                            1
Name: Product Name, Length: 1850, dtype: int64

# aggregate data with pandas

In [90]:
df.head()

,Month of Order Date,Product Name,Sales
0,2013-05-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",208.0
1,2015-06-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",208.0
2,2013-11-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",333.0
3,2016-07-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",416.0
4,2016-11-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",500.0

In [99]:
# yearly sales summary
df.groupby(
    df['Month of Order Date'].str[:5]).describe().reset_index().rename(columns={'Month of Order Date': 'Year of Order'})

  Year of Order   Sales                                                   \
                  count        mean         std  min   25%   50%     75%
0         2013-  1875.0  258.267200  803.537374  1.0  17.0  55.0  224.00
1         2014-  1968.0  239.107215  521.330289  1.0  19.0  62.0  225.25
2         2015-  2400.0  253.550833  711.795040  1.0  19.0  58.5  222.00
3         2016-  3009.0  243.940512  627.741547  0.0  18.0  60.0  221.00


       max
0  22638.0
1   7312.0
2  17500.0
3  14000.0

In [101]:
# yearly product sales totals
df_export = df.groupby([df['Month of Order Date'].str[:4], 'Product Name']).sum().reset_index()
df_export.rename(columns={'Month of the Order Date': 'Year of Order'})
df_export.head(10)

,Month of Order Date,Product Name,Sales
0,2013,"#10 White Business Envelopes,4 1/8 x 9 1/2",156.0
1,2013,"#10- 4 1/8"" x 9 1/2"" Recycled Envelopes",63.0
2,2013,"#10- 4 1/8"" x 9 1/2"" Security-Tint Envelopes",23.0
3,2013,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",541.0
4,2013,1/4 Fold Party Design Invitations & White Enve...,6.0
5,2013,12 Colored Short Pencils,6.0
6,2013,12-1/2 Diameter Round Wall Clock,64.0
7,2013,2300 Heavy-Duty Transfer File Systems by Perma,100.0
8,2013,"24 Capacity Maxi Data Binder Racks, Pearl",505.0
9,2013,24-Hour Round Wall Clock,140.0

In [97]:
# overall product sales totals
df.groupby('Product Name').sum().reset_index()

                                           Product Name   Sales
0     "While you Were Out" Message Book, One Form pe...    25.0
1              #10 Gummed Flap White Envelopes, 100/Box    42.0
2                         #10 Self-Seal White Envelopes   109.0
3            #10 White Business Envelopes,4 1/8 x 9 1/2   489.0
4               #10- 4 1/8" x 9 1/2" Recycled Envelopes   286.0
...                                                 ...     ...
1845  iKross Bluetooth Portable Keyboard + Cell Phon...   479.0
1846                         iOttie HLCRIO102 Car Mount   216.0
1847                                iOttie XL Car Mount   224.0
1848  invisibleSHIELD by ZAGG Smudge-Free Screen Pro...   442.0
1849                 netTALK DUO VoIP Telephone Service  1113.0

[1850 rows x 2 columns]

# export data with pandas

In [3]:
df = pd.read_csv('data/MonthlyProductSales.csv', encoding='latin-1')

In [4]:
df.head()

,Month of Order Date,Product Name,Sales
0,2013-05-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",208.0
1,2015-06-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",208.0
2,2013-11-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",333.0
3,2016-07-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",416.0
4,2016-11-01,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",500.0

In [5]:
df.columns

Index(['Month of Order Date', 'Product Name', 'Sales'], dtype='object')

In [6]:
df['Month of Order Date']

0       2013-05-01
1       2015-06-01
2       2013-11-01
3       2016-07-01
4       2016-11-01
           ...
9247    2016-06-01
9248    2016-07-01
9249    2013-04-01
9250    2016-12-01
9251    2013-07-01
Name: Month of Order Date, Length: 9252, dtype: object

In [7]:
df.describe()

              Sales
count   9252.000000
mean     248.308798
std      669.441779
min        0.000000
25%       18.000000
50%       60.000000
75%      222.000000
max    22638.000000

In [8]:
df_export = df.copy()

In [10]:
new_df = df.groupby([df_export['Month of Order Date'].str[:4], 'Product Name']).sum().reset_index()
new_df = new_df.rename(columns={'Month of Order Date': 'Year of Order'})

In [11]:
new_df

     Year of Order                                       Product Name  Sales
0             2013         #10 White Business Envelopes,4 1/8 x 9 1/2  156.0
1             2013            #10- 4 1/8" x 9 1/2" Recycled Envelopes   63.0
2             2013       #10- 4 1/8" x 9 1/2" Security-Tint Envelopes   23.0
3             2013  1.7 Cubic Foot Compact "Cube" Office Refrigera...  541.0
4             2013  1/4 Fold Party Design Invitations & White Enve...    6.0
...            ...                                                ...    ...
5321          2016  iKross Bluetooth Portable Keyboard + Cell Phon...   67.0
5322          2016                         iOttie HLCRIO102 Car Mount  120.0
5323          2016                                iOttie XL Car Mount  224.0
5324          2016  invisibleSHIELD by ZAGG Smudge-Free Screen Pro...  205.0
5325          2016                 netTALK DUO VoIP Telephone Service  168.0

[5326 rows x 3 columns]

In [13]:
new_df.to_csv('data/YearlyProductSalesTotals.csv', header=True, index=False, encoding='utf-8')

In [14]:
new_df.to_json('data/YearlyProductSalesTotals.json', orient='records')

In [16]:
new_df.to_excel('data/YearlyProductSalesTotals.xlsx', header=True, index=False)

In [17]:
df_excel = pd.read_excel('data/YearlyProductSalesTotals.xlsx', header=0, index_col=None)

In [18]:
df_excel.head()

   Year of Order                                       Product Name  Sales
0           2013         #10 White Business Envelopes,4 1/8 x 9 1/2    156
1           2013            #10- 4 1/8" x 9 1/2" Recycled Envelopes     63
2           2013       #10- 4 1/8" x 9 1/2" Security-Tint Envelopes     23
3           2013  1.7 Cubic Foot Compact "Cube" Office Refrigera...    541
4           2013  1/4 Fold Party Design Invitations & White Enve...      6